; domain
(define (domain zeno-travel)
(:requirements :typing :strips)
(:types transportable city flevel - object
        aircraft person - transportable)

(:predicates (at ?x - transportable ?c - city)
             (in ?a - aircraft ?p - person)
	     (fuel-level ?a - aircraft ?l - flevel)
	     (next ?l1 - flevel ?l2 - flevel))


(:action board
 :parameters (?a - person ?b - aircraft ?c - city)

 :precondition (and (at ?a ?c)
                 (at ?b ?c))
 :effect (and (not (at ?a ?c))
              (in ?a ?b)))

(:action debark
 :parameters (?a - person ?b - aircraft ?c - city)

 :precondition (and (in ?a ?b)
                 (at ?b ?c))
 :effect (and (not (in ?a ?b))
              (at ?a ?c)))

(:action fly
 :parameters (?a - aircraft ?b - city ?c - city ?d - flevel ?e - flevel)

 :precondition (and (at ?a ?b)
                 (fuel-level ?a ?d)
		 (next ?e ?d))
 :effect (and (not (at ?a ?b))
              (at ?a ?c)
              (not (fuel-level ?a ?d))
              (fuel-level ?a ?e)))

(:action zoom
 :parameters (?a - aircraft ?b - city ?c - city ?d - flevel ?e - flevel ?f - flevel)

 :precondition (and (at ?a ?b)
                 (fuel-level ?a ?d)
		 (next ?e ?d)
		 (next ?f ?e)
		)
 :effect (and (not (at ?a ?b))
              (at ?a ?c)
              (not (fuel-level ?a ?d))
              (fuel-level ?a ?f)
	)
)

(:action refuel
 :parameters (?a - aircraft ?b - city ?c - flevel ?d - flevel)

 :precondition (and (fuel-level ?a ?c)
                 (next ?c ?d)
                 (at ?a ?b))
 :effect (and (fuel-level ?a ?d) (not (fuel-level ?a ?c))))


)

; problem
(define (problem ZTRAVEL-7-8)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	plane4 - aircraft
	plane5 - aircraft
	plane6 - aircraft
	plane7 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	city6 - city
	city7 - city
	fl0 - flevel
	fl1 - flevel
	fl2 - flevel
	fl3 - flevel
	fl4 - flevel
	fl5 - flevel
	fl6 - flevel
	)
(:init
	(at plane1 city5)
	(fuel-level plane1 fl5)
	(at plane2 city7)
	(fuel-level plane2 fl2)
	(at plane3 city4)
	(fuel-level plane3 fl0)
	(at plane4 city4)
	(fuel-level plane4 fl4)
	(at plane5 city7)
	(fuel-level plane5 fl6)
	(at plane6 city6)
	(fuel-level plane6 fl6)
	(at plane7 city5)
	(fuel-level plane7 fl3)
	(at person1 city4)
	(at person2 city2)
	(at person3 city6)
	(at person4 city5)
	(at person5 city4)
	(at person6 city2)
	(at person7 city5)
	(at person8 city6)
	(next fl0 fl1)
	(next fl1 fl2)
	(next fl2 fl3)
	(next fl3 fl4)
	(next fl4 fl5)
	(next fl5 fl6)
)
(:goal (and
	(at plane2 city1)
	(at plane3 city1)
	(at plane6 city2)
	(at person1 city1)
	(at person2 city3)
	(at person3 city1)
	(at person4 city3)
	(at person5 city2)
	(at person6 city4)
	(at person7 city3)
	(at person8 city0)
	))

)

; plan
1. (zoom plane6 city6 city2 fl6 fl5 fl4)
   deleted: (at plane6 city6) (fuel-level plane6 fl6)
   added: (at plane6 city2) (fuel-level plane6 fl4)
   goals met: 1 of 11
2. (board person6 plane6 city2)
   deleted: (at person6 city2)
   added: (in person6 plane6)
   goals met: 1 of 11
3. (board person2 plane6 city2)
   deleted: (at person2 city2)
   added: (in person2 plane6)
   goals met: 1 of 11
4. (board person5 plane4 city4)
   deleted: (at person5 city4)
   added: (in person5 plane4)
   goals met: 1 of 11
5. (board person1 plane4 city4)
   deleted: (at person1 city4)
   added: (in person1 plane4)
   goals met: 1 of 11
6. (zoom plane4 city4 city1 fl4 fl3 fl2)
   deleted: (at plane4 city4) (fuel-level plane4 fl4)
   added: (at plane4 city1) (fuel-level plane4 fl2)
   goals met: 1 of 11
7. (debark person1 plane4 city1)
   deleted: (in person1 plane4)
   added: (at person1 city1)
   goals met: 2 of 11
8. (zoom plane4 city1 city2 fl2 fl1 fl0)
   deleted: (at plane4 city1) (fuel-level plane4 fl2)
   added: (at plane4 city2) (fuel-level plane4 fl0)
   goals met: 2 of 11
9. (debark person5 plane4 city2)
   deleted: (in person5 plane4)
   added: (at person5 city2)
   goals met: 3 of 11
10. (refuel plane3 city4 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 3 of 11
11. (fly plane3 city4 city1 fl1 fl0)
   deleted: (at plane3 city4) (fuel-level plane3 fl1)
   added: (at plane3 city1) (fuel-level plane3 fl0)
   goals met: 4 of 11
12. (zoom plane2 city7 city1 fl2 fl1 fl0)
   deleted: (at plane2 city7) (fuel-level plane2 fl2)
   added: (at plane2 city1) (fuel-level plane2 fl0)
   goals met: 5 of 11
13. (zoom plane1 city5 city6 fl5 fl4 fl3)
   deleted: (at plane1 city5) (fuel-level plane1 fl5)
   added: (at plane1 city6) (fuel-level plane1 fl3)
   goals met: 5 of 11
14. (board person7 plane7 city5)
   deleted: (at person7 city5)
   added: (in person7 plane7)
   goals met: 5 of 11
15. (board person4 plane7 city5)
   deleted: (at person4 city5)
   added: (in person4 plane7)
   goals met: 5 of 11
16. (zoom plane7 city5 city3 fl3 fl2 fl1)
   deleted: (at plane7 city5) (fuel-level plane7 fl3)
   added: (at plane7 city3) (fuel-level plane7 fl1)
   goals met: 5 of 11
17. (debark person7 plane7 city3)
   deleted: (in person7 plane7)
   added: (at person7 city3)
   goals met: 6 of 11
18. (debark person4 plane7 city3)
   deleted: (in person4 plane7)
   added: (at person4 city3)
   goals met: 7 of 11
19. (board person8 plane1 city6)
   deleted: (at person8 city6)
   added: (in person8 plane1)
   goals met: 7 of 11
20. (board person3 plane1 city6)
   deleted: (at person3 city6)
   added: (in person3 plane1)
   goals met: 7 of 11
21. (zoom plane1 city6 city0 fl3 fl2 fl1)
   deleted: (at plane1 city6) (fuel-level plane1 fl3)
   added: (at plane1 city0) (fuel-level plane1 fl1)
   goals met: 7 of 11
22. (debark person8 plane1 city0)
   deleted: (in person8 plane1)
   added: (at person8 city0)
   goals met: 8 of 11
23. (fly plane1 city0 city1 fl1 fl0)
   deleted: (at plane1 city0) (fuel-level plane1 fl1)
   added: (at plane1 city1) (fuel-level plane1 fl0)
   goals met: 8 of 11
24. (debark person3 plane1 city1)
   deleted: (in person3 plane1)
   added: (at person3 city1)
   goals met: 9 of 11
25. (zoom plane6 city2 city3 fl4 fl3 fl2)
   deleted: (at plane6 city2) (fuel-level plane6 fl4)
   added: (at plane6 city3) (fuel-level plane6 fl2)
   goals met: 8 of 11
26. (debark person2 plane6 city3)
   deleted: (in person2 plane6)
   added: (at person2 city3)
   goals met: 9 of 11
27. (zoom plane6 city3 city4 fl2 fl1 fl0)
   deleted: (at plane6 city3) (fuel-level plane6 fl2)
   added: (at plane6 city4) (fuel-level plane6 fl0)
   goals met: 9 of 11
28. (refuel plane6 city4 fl0 fl1)
   deleted: (fuel-level plane6 fl0)
   added: (fuel-level plane6 fl1)
   goals met: 9 of 11
29. (debark person6 plane6 city4)
   deleted: (in person6 plane6)
   added: (at person6 city4)
   goals met: 10 of 11
30. (fly plane6 city4 city2 fl1 fl0)
   deleted: (at plane6 city4) (fuel-level plane6 fl1)
   added: (at plane6 city2) (fuel-level plane6 fl0)
   goals met: 11 of 11
